In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([.25, .5,.75,1.0],
                index = ['a', 'b', 'c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
data['b']

0.5

In [4]:
'a' in data

True

In [5]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [7]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [8]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [9]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [10]:
data[(data > 0.3) & (data < .8)]

b    0.50
c    0.75
dtype: float64

In [11]:
data[['a','e']]

a    0.25
e    1.25
dtype: float64

In [12]:
data = pd.Series(['a', 'b', 'c'],
                index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [13]:
data[1]

'a'

In [14]:
data[1:3]

3    b
5    c
dtype: object

In [15]:
data.loc[1]

'a'

In [16]:
data.loc[1:3]

1    a
3    b
dtype: object

In [18]:
data.iloc[0]

'a'

In [19]:
data.iloc[1]

'b'

In [47]:
area =pd.Series({
    'California' : 35555,
    'Texas': 466666,
    'New Work': 57777,
    'Florida' : 897265,
    "Illionis": 7213345
})


pop =pd.Series({
    'California' : 35555,
    'Texas': 466666,
    'New Work': 57777,
    'Florida' : 897265,
    "Illionis": 7213345
})

data = pd.DataFrame({'area': area, 'pop':pop})

In [48]:
data['area']

California      35555
Texas          466666
New Work        57777
Florida        897265
Illionis      7213345
Name: area, dtype: int64

In [49]:
data['pop']

California      35555
Texas          466666
New Work        57777
Florida        897265
Illionis      7213345
Name: pop, dtype: int64

In [50]:
data.area

California      35555
Texas          466666
New Work        57777
Florida        897265
Illionis      7213345
Name: area, dtype: int64

In [51]:
data.pop

<bound method DataFrame.pop of                area      pop
California    35555    35555
Texas        466666   466666
New Work      57777    57777
Florida      897265   897265
Illionis    7213345  7213345>

In [52]:
data.area is data['area']

True

In [46]:
data.pop is data['pop']

False

In [53]:
data['density'] = data['pop'] / data['area']

In [54]:
data

               area      pop  density
California    35555    35555      1.0
Texas        466666   466666      1.0
New Work      57777    57777      1.0
Florida      897265   897265      1.0
Illionis    7213345  7213345      1.0

In [55]:
data.values

array([[3.555500e+04, 3.555500e+04, 1.000000e+00],
       [4.666660e+05, 4.666660e+05, 1.000000e+00],
       [5.777700e+04, 5.777700e+04, 1.000000e+00],
       [8.972650e+05, 8.972650e+05, 1.000000e+00],
       [7.213345e+06, 7.213345e+06, 1.000000e+00]])

In [56]:
data.T

         California     Texas  New Work   Florida   Illionis
area        35555.0  466666.0   57777.0  897265.0  7213345.0
pop         35555.0  466666.0   57777.0  897265.0  7213345.0
density         1.0       1.0       1.0       1.0        1.0

In [57]:
data.values[0]

array([3.5555e+04, 3.5555e+04, 1.0000e+00])

In [58]:
data['area']

California      35555
Texas          466666
New Work        57777
Florida        897265
Illionis      7213345
Name: area, dtype: int64

In [59]:
data.iloc[:3 , :2]

              area     pop
California   35555   35555
Texas       466666  466666
New Work     57777   57777

In [61]:
data.loc[:'Illionis' , :'pop']

               area      pop
California    35555    35555
Texas        466666   466666
New Work      57777    57777
Florida      897265   897265
Illionis    7213345  7213345

In [62]:
data.ix[:3 ,:'pop']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [65]:
data.loc[data.density > .75 , ['pop', 'density']]

                pop  density
California    35555      1.0
Texas        466666      1.0
New Work      57777      1.0
Florida      897265      1.0
Illionis    7213345      1.0

In [66]:
data.iloc[0,2] = 90
data

               area      pop  density
California    35555    35555     90.0
Texas        466666   466666      1.0
New Work      57777    57777      1.0
Florida      897265   897265      1.0
Illionis    7213345  7213345      1.0

In [67]:
data['Florida' : 'Illionis']

             area      pop  density
Florida    897265   897265      1.0
Illionis  7213345  7213345      1.0

In [68]:
data[1:3]

            area     pop  density
Texas     466666  466666      1.0
New Work   57777   57777      1.0

In [70]:
data[data.density > 1]

             area    pop  density
California  35555  35555     90.0